Catalogs/ПоставкиПродуктов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ПоставкиПродуктов_ат</Name>
			<Comment>//!!!!!HOTFIX</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтрагентВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерКраткий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерПолный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_КомментарийВнутренний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СвязиПродуктов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СвязиПродуктов_ат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОсновнойПродукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйПродукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыПродуктов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыПродуктов_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Документация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументацияПП1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентскаяЛицензия1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентскаяЛицензияПП1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентскийДоступMSSQLServer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючUSB1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлючUSBКонфигурации1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Книга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конфигурация1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Платформа1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийПП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочийППMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервер_nix</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервер1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерверIBMDB2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерверMSSQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерверMSWindows</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерверOracle</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерверPostgreSQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерверВеб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдаленныйДоступMSServer</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Продукты_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Продукты_ат</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДляНаименованияИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНаАнглийском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеУПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьДляКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПродукта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПродуктов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_КомментарийВнутренний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеМетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Метки_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭкземплярыПродуктов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ЭкземплярыПродуктов_ат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПоставкиПродуктов_ат</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлиентАрендатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольСервераРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиСерверов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверРазмещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Серверы_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПродуктов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПродукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_КомментарийВнутренний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодительскийЭП</Name>
					<Comment>//!!!!!HOTFIX</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭкземплярыПродуктов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРодительскогоЭП</Name>
					<Comment>//!!!!!HOTFIX</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРодительскогоЭП_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПоставкиПродуктов_ат/Forms/ФормаГрупповогоСозданияПоставок/Ext/Form/Module.bsl
//!!!!!HOTFIX

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Продукт) Тогда
		ОсновнойПродукт = Параметры.Продукт;
		ЗаполнитьТаблицуДочернихПродуктов();
	Иначе 
		Элементы.ДочерниеПродукты.Доступность = Ложь;
	КонецЕсли;
	
	СоздаватьЭкземпляры = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойПродуктПриИзменении(Элемент)

	Если ЗначениеЗаполнено(ОсновнойПродукт) Тогда
		ЗаполнитьТаблицуДочернихПродуктов();
	Иначе
		ДочерниеПродукты.Очистить();
		Элементы.ДочерниеПродукты.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("ИсключитьДочерниеПродуктыИКонфигурации", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПродукта", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Продукты_ат.ФормаВыбора", ПараметрыОткрытия,
		ЭтаФорма, УникальныйИдентификатор,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПродукта(Результат, ПередаваемыеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		НоваяСтрока = ДочерниеПродукты.Добавить();
		НоваяСтрока.Продукт = Результат;
		НоваяСтрока.Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДочернихПродуктов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК Пометка,
	|	СвязиПродуктов_ат.ПодчиненныйПродукт
	|ИЗ
	|	РегистрСведений.СвязиПродуктов_ат КАК СвязиПродуктов_ат
	|ГДЕ
	|	СвязиПродуктов_ат.ОсновнойПродукт = &ОсновнойПродукт";
	
	Запрос.УстановитьПараметр("ОсновнойПродукт", ОсновнойПродукт);
	
	ДочерниеПродукты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьПоставки(Команда)
	
	ТекстПредупреждения = "";
	
	Если НЕ ЗначениеЗаполнено(ОсновнойПродукт) Тогда
		
		ТекстПредупреждения = ТекстПредупреждения + ?(ЗначениеЗаполнено(ТекстПредупреждения), ", ", "") + """Основной продукт""";
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КонтрагентВладелец) Тогда
		
		ТекстПредупреждения = ТекстПредупреждения + ?(ЗначениеЗаполнено(ТекстПредупреждения), ", ", "") + """Контрагент владелец""";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		
		ТекстПредупреждения = "Необходимо заполнить: " + ТекстПредупреждения;
		ПоказатьПредупреждение(, ТекстПредупреждения, 10);
		
		Возврат;
		
	КонецЕсли;
	
	Если СоздатьПоставки_Сервер() Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   СоздатьПоставки_Сервер()
	
	Попытка
		
		НачатьТранзакцию();
		
		СоздатьПоставку(ОсновнойПродукт, КонтрагентВладелец, СоздаватьЭкземпляры, Истина, ОписаниеПоставки);
		
		Для Каждого Строка Из ДочерниеПродукты Цикл
			
			Если НЕ Строка.Пометка Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			СоздатьПоставку(Строка.ПодчиненныйПродукт, КонтрагентВладелец, СоздаватьЭкземпляры,, Строка.Описание);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Возврат Истина;
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура СоздатьПоставку(Продукт, Владелец, СоздатьЭкземпляр, Основная = Ложь, Описание = "")
	
	НоваяПоставка = Справочники.ПоставкиПродуктов_ат.СоздатьЭлемент();
	НоваяПоставка.Продукт = Продукт;
	НоваяПоставка.Наименование = Строка(Продукт);
	НоваяПоставка.Описание = Описание;
	НоваяПоставка.Родитель = ОсновнаяПоставка;
	НоваяПоставка.КонтрагентВладелец = Владелец;
	НоваяПоставка.Записать();
	
	Если СоздатьЭкземпляр Тогда
		
		СоздатьЭкземплярыПродукта(НоваяПоставка.Ссылка, Продукт, Описание);
		
	КонецЕсли;
	
	Если Основная Тогда
		
		ОсновнаяПоставка = НоваяПоставка.Ссылка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭкземплярыПродукта(Поставка, Продукт, Описание = "")
	
	КоличествоЭкземпляров = ?(Продукт.Количество < 2, 1, Продукт.Количество);
	
	Если Продукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Документация
		ИЛИ Продукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.ДокументацияПП1С
		ИЛИ Продукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Книга
		Тогда
		
		Для Сч = 1 По КоличествоЭкземпляров Цикл
			
			НовыйЭкземпляр = СоздатьЭкземплярПродукта(Поставка, Продукт, 1,
				?(КоличествоЭкземпляров > 1, "часть " + Сч, ""));
			
		КонецЦикла;
		
	Иначе
		
		СоздатьЭкземплярПродукта(Поставка, Продукт, КоличествоЭкземпляров, Описание);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   СоздатьЭкземплярПродукта(Поставка, Продукт, КоличествоЭкземпляров, Описание)
	
	НовыйЭкземпляр = Справочники.ЭкземплярыПродуктов_ат.СоздатьЭлемент();
	
	НовыйЭкземпляр.Наименование = Строка(Продукт);
	НовыйЭкземпляр.Описание = Описание;
	НовыйЭкземпляр.Владелец = Поставка;
	НовыйЭкземпляр.ТекущийПродукт = Продукт;
	НовыйЭкземпляр.Количество = КоличествоЭкземпляров;
	
	НовыйЭкземпляр.Записать();
	
	Возврат НовыйЭкземпляр.Ссылка;
	
КонецФункции
